<details><summary>Show OpenTofu Plan</summary>

```


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # openstack_compute_instance_v2.testinstance11 will be updated in-place
  ~ resource "openstack_compute_instance_v2" "testinstance11" {
        id                  = "6ac8a6e5-eaa9-4005-8d9b-420a160e1edf"
        name                = "accounts-test11"
      ~ security_groups     = [
          - "default",
          + "accounts-testinstance",
            # (2 unchanged elements hidden)
        ]
        tags                = []
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # openstack_compute_instance_v2.testinstance11_legacy will be created
  + resource "openstack_compute_instance_v2" "testinstance11_legacy" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = "41f0ea41-75ca-44a6-be66-bb56b2a90721"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = "01b13195-260c-4c8f-8378-8f5aa5344ede"
      + image_name          = (known after apply)
      + name                = "accounts-test11-legacy"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "accounts-application",
          + "accounts-default",
        ]
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = "7425e328-560c-4f00-8e99-706f3fb90bb4"
        }
    }

  # openstack_compute_instance_v2.testinstance12 will be updated in-place
  ~ resource "openstack_compute_instance_v2" "testinstance12" {
        id                  = "5732c0dc-5e66-43c1-be8e-e8334eefeda9"
        name                = "accounts-test12"
      ~ security_groups     = [
          + "accounts-testinstance",
            # (2 unchanged elements hidden)
        ]
        tags                = []
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # openstack_networking_secgroup_rule_v2.udp_in["IPv4"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "udp_in" {
      + description             = "NTP inbound"
      + direction               = "ingress"
      + ethertype               = "IPv4"
      + id                      = (known after apply)
      + port_range_max          = 123
      + port_range_min          = 123
      + protocol                = "udp"
      + region                  = (known after apply)
      + remote_address_group_id = (known after apply)
      + remote_group_id         = (known after apply)
      + remote_ip_prefix        = "0.0.0.0/0"
      + security_group_id       = (known after apply)
      + tenant_id               = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.udp_in["IPv6"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "udp_in" {
      + description             = "NTP inbound"
      + direction               = "ingress"
      + ethertype               = "IPv6"
      + id                      = (known after apply)
      + port_range_max          = 123
      + port_range_min          = 123
      + protocol                = "udp"
      + region                  = (known after apply)
      + remote_address_group_id = (known after apply)
      + remote_group_id         = (known after apply)
      + remote_ip_prefix        = "::/0"
      + security_group_id       = (known after apply)
      + tenant_id               = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.udp_out["IPv4"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "udp_out" {
      + description             = "NTP outbound"
      + direction               = "egress"
      + ethertype               = "IPv4"
      + id                      = (known after apply)
      + port_range_max          = 123
      + port_range_min          = 123
      + protocol                = "udp"
      + region                  = (known after apply)
      + remote_address_group_id = (known after apply)
      + remote_group_id         = (known after apply)
      + remote_ip_prefix        = "0.0.0.0/0"
      + security_group_id       = (known after apply)
      + tenant_id               = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.udp_out["IPv6"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "udp_out" {
      + description             = "NTP outbound"
      + direction               = "egress"
      + ethertype               = "IPv6"
      + id                      = (known after apply)
      + port_range_max          = 123
      + port_range_min          = 123
      + protocol                = "udp"
      + region                  = (known after apply)
      + remote_address_group_id = (known after apply)
      + remote_group_id         = (known after apply)
      + remote_ip_prefix        = "::/0"
      + security_group_id       = (known after apply)
      + tenant_id               = (known after apply)
    }

  # openstack_networking_secgroup_v2.testinstance will be created
  + resource "openstack_networking_secgroup_v2" "testinstance" {
      + all_tags             = (known after apply)
      + delete_default_rules = true
      + description          = "Managed by Terraform"
      + id                   = (known after apply)
      + name                 = "accounts-testinstance"
      + region               = (known after apply)
      + stateful             = (known after apply)
      + tenant_id            = (known after apply)
    }

  # module.dns_test11_legacy.openstack_dns_recordset_v2.a will be created
  + resource "openstack_dns_recordset_v2" "a" {
      + disable_status_check = false
      + id                   = (known after apply)
      + name                 = "test11-legacy.svc.account-creation-assistance.eqiad1.wikimedia.cloud."
      + project_id           = (known after apply)
      + records              = (known after apply)
      + region               = (known after apply)
      + ttl                  = 900
      + type                 = "A"
      + zone_id              = "22fe5641-3813-47bf-b6ab-c6d17c1962c1"
    }

Plan: 7 to add, 2 to change, 0 to destroy.

```

</details>

*Pushed by: @stwalkerster, Action: `pull_request`*